# Load data from hdf5 store

Demonstrates how to load in names data from the hdf5 storage container.

In [1]:
import pandas as pd

### Read in male names 

Male names are stored in the group *malename*

In [2]:
mnames = pd.read_hdf('names.hf5','malename')
print mnames.shape
mnames.head()

(757831, 4)

    firstname sex  count  year
942      John   M   9655  1880
943   William   M   9531  1880
944     James   M   5927  1880
945   Charles   M   5348  1880
946    George   M   5126  1880

### Read in female names

Female names are stored in the group *femalename*

In [3]:
fnames = pd.read_hdf('names.hf5','femalename')
print fnames.shape
fnames.head()

(1100858, 4)

   firstname sex  count  year
0       Mary   F   7065  1880
1       Anna   F   2604  1880
2       Emma   F   2003  1880
3  Elizabeth   F   1939  1880
4     Minnie   F   1746  1880

### Read in last names

Last names are stored in the group *lastname*

In [4]:
lnames = pd.read_hdf('names.hf5','lastname')
print lnames.shape
lnames.head()

(151671, 9)

,lastname,rank,count,pctwhite,pctblack,pctapi,pctaian,pct2prace,pcthispanic
0,SMITH,1,2376206,73.35,22.22,0.4,0.85,1.63,1.56
1,JOHNSON,2,1857160,61.55,33.8,0.42,0.91,1.82,1.5
2,WILLIAMS,3,1534042,48.52,46.72,0.37,0.78,2.01,1.6
3,BROWN,4,1380145,60.71,34.54,0.41,0.83,1.86,1.64
4,JONES,5,1362755,57.69,37.73,0.35,0.94,1.85,1.44